Revit 2027 API
BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeWarning Property
 Cannot create a DirectShape or DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateDirectShapeOrTypeWarning { get; }
Public Shared ReadOnly Property CannotCreateDirectShapeOrTypeWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateDirectShapeOrTypeWarning {
	FailureDefinitionId^ get ();
}
static member CannotCreateDirectShapeOrTypeWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DirectShapeFailures Class
Autodesk.Revit.DB Namespace